package com.actor.chat_layout.emoji;

/**
 * Description: 默认表情列表
 * Author     : ldf
 * Date       : 2019/6/3 on 14:16
 */
public class DefaultEmojiList {

    //默认emoji列表, 每行8个
    public static final String[] DEFAULT_EMOJI_LIST = new String[]{
            "[龇牙]",   "[调皮]", "[流汗]",  "[偷笑]", "[再见]",  "[敲打]",  "[擦汗]", "[猪头]",
            "[玫瑰]",   "[流泪]", "[大哭]",  "[嘘]",   "[酷]",    "[抓狂]", "[委屈]",  "[便便]",
            "[炸弹]",   "[菜刀]", "[可爱]",  "[色]",   "[害羞]",  "[得意]",  "[吐]",   "[微笑]",
            "[怒]",     "[尴尬]", "[惊恐]",  "[冷汗]", "[爱心]",  "[示爱]",  "[白眼]", "[傲慢]",
            "[难过]",   "[惊讶]", "[疑问]",  "[困]",   "[么么哒]", "[憨笑]", "[爱情]", "[衰]",
            "[撇嘴]",   "[阴险]", "[奋斗]",  "[发呆]", "[右哼哼]", "[抱抱]", "[坏笑]", "[飞吻]",
            "[鄙视]",   "[晕]",   "[大兵]",  "[可怜]", "[强]",     "[弱]",   "[握手]", "[胜利]",
            "[抱拳]",   "[凋谢]", "[米饭]",  "[蛋糕]", "[西瓜]",   "[啤酒]", "[瓢虫]",  "[勾引]",
            "[OK]",    "[爱你]",  "[咖啡]",  "[月亮]", "[刀]",     "[发抖]", "[差劲]", "[拳头]",
            "[心碎了]", "[太阳]", "[礼物]",   "[皮球]", "[骷髅]",   "[挥手]", "[闪电]", "[饥饿]",
            "[困]",     "[咒骂]", "[折磨]",   "[抠鼻]", "[鼓掌]", "[糗大了]", "[左哼哼]", "[打哈欠]",
            "[快哭了]", "[吓]",   "[篮球]",   "[乒乓]", "[NO]",   "[跳跳]",   "[怄火]", "[转圈]",
            "[磕头]",   "[回头]", "[跳绳]",   "[激动]", "[街舞]", "[献吻]",   "[左太极]", "[右太极]",
            "[闭嘴]",   "[猫咪]", "[红双喜]", "[鞭炮]", "[红灯笼]", "[麻将]", "[麦克风]", "[礼品袋]",
            "[信封]",   "[象棋]", "[彩带]",   "[蜡烛]", "[爆筋]",  "[棒棒糖]", "[奶瓶]", "[面条]",
            "[香蕉]",   "[飞机]", "[左车头]", "[车厢]", "[右车头]", "[多云]",  "[下雨]", "[钞票]",
            "[熊猫]",   "[灯泡]", "[风车]",   "[闹钟]", "[雨伞]",   "[彩球]", "[钻戒]", "[沙发]",
            "[纸巾]",   "[手枪]", "[青蛙]",   "[汽车]", "[睡觉]",   "[药]"     //TIMSDK没加最后3个Emoji
    };
}
